examples/fsi/multiflap/fluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

vertices
(
    (-9.25 0.0 -0.25 )         // 0
    (-4.25 0.0 -0.25 )         // 1
    (-4.15 0.0 -0.25 )         // 2
    (-2.15 0.0 -0.25 )         // 3
    (-2.05 0.0 -0.25 )         // 4
    (-0.04999999999999982 0.0 -0.25 )         // 5
    (0.05000000000000018 0.0 -0.25 )         // 6
    (2.0500000000000007 0.0 -0.25 )         // 7
    (2.150000000000001 0.0 -0.25 )         // 8
    (4.15 0.0 -0.25 )         // 9
    (4.25 0.0 -0.25 )         // 10
    (9.25 0.0 -0.25 )         // 11
    (-9.25 1.0 -0.25 )         // 12
    (-4.25 1.0 -0.25 )         // 13
    (-4.15 1.0 -0.25 )         // 14
    (-2.15 1.0 -0.25 )         // 15
    (-2.05 1.0 -0.25 )         // 16
    (-0.04999999999999982 1.0 -0.25 )         // 17
    (0.05000000000000018 1.0 -0.25 )         // 18
    (2.0500000000000007 1.0 -0.25 )         // 19
    (2.150000000000001 1.0 -0.25 )         // 20
    (4.15 1.0 -0.25 )         // 21
    (4.25 1.0 -0.25 )         // 22
    (9.25 1.0 -0.25 )         // 23
    (-9.25 5.0 -0.25 )         // 24
    (-4.25 5.0 -0.25 )         // 25
    (-4.15 5.0 -0.25 )         // 26
    (-2.15 5.0 -0.25 )         // 27
    (-2.05 5.0 -0.25 )         // 28
    (-0.04999999999999982 5.0 -0.25 )         // 29
    (0.05000000000000018 5.0 -0.25 )         // 30
    (2.0500000000000007 5.0 -0.25 )         // 31
    (2.150000000000001 5.0 -0.25 )         // 32
    (4.15 5.0 -0.25 )         // 33
    (4.25 5.0 -0.25 )         // 34
    (9.25 5.0 -0.25 )         // 35
    (-9.25 0.0 0.25 )         // 36
    (-4.25 0.0 0.25 )         // 37
    (-4.15 0.0 0.25 )         // 38
    (-2.15 0.0 0.25 )         // 39
    (-2.05 0.0 0.25 )         // 40
    (-0.04999999999999982 0.0 0.25 )         // 41
    (0.05000000000000018 0.0 0.25 )         // 42
    (2.0500000000000007 0.0 0.25 )         // 43
    (2.150000000000001 0.0 0.25 )         // 44
    (4.15 0.0 0.25 )         // 45
    (4.25 0.0 0.25 )         // 46
    (9.25 0.0 0.25 )         // 47
    (-9.25 1.0 0.25 )         // 48
    (-4.25 1.0 0.25 )         // 49
    (-4.15 1.0 0.25 )         // 50
    (-2.15 1.0 0.25 )         // 51
    (-2.05 1.0 0.25 )         // 52
    (-0.04999999999999982 1.0 0.25 )         // 53
    (0.05000000000000018 1.0 0.25 )         // 54
    (2.0500000000000007 1.0 0.25 )         // 55
    (2.150000000000001 1.0 0.25 )         // 56
    (4.15 1.0 0.25 )         // 57
    (4.25 1.0 0.25 )         // 58
    (9.25 1.0 0.25 )         // 59
    (-9.25 5.0 0.25 )         // 60
    (-4.25 5.0 0.25 )         // 61
    (-4.15 5.0 0.25 )         // 62
    (-2.15 5.0 0.25 )         // 63
    (-2.05 5.0 0.25 )         // 64
    (-0.04999999999999982 5.0 0.25 )         // 65
    (0.05000000000000018 5.0 0.25 )         // 66
    (2.0500000000000007 5.0 0.25 )         // 67
    (2.150000000000001 5.0 0.25 )         // 68
    (4.15 5.0 0.25 )         // 69
    (4.25 5.0 0.25 )         // 70
    (9.25 5.0 0.25 )         // 71
);

blocks
(
    hex (   0   1   13  12  36  37  49  48  )
    (50 37 1)
    simpleGrading (0.1 5.791816135971869 1.0)

    hex (   2   3   15  14  38  39  51  50  )
    (50 37 1)
    simpleGrading (1.0 5.791816135971869 1.0)

    hex (   4   5   17  16  40  41  53  52  )
    (50 37 1)
    simpleGrading (1.0 5.791816135971869 1.0)

    hex (   6   7   19  18  42  43  55  54  )
    (50 37 1)
    simpleGrading (1.0 5.791816135971869 1.0)

    hex (   8   9   21  20  44  45  57  56  )
    (50 37 1)
    simpleGrading (1.0 5.791816135971869 1.0)

    hex (   10  11  23  22  46  47  59  58  )
    (50 37 1)
    simpleGrading (10.0 5.791816135971869 1.0)

    hex (   12  13  25  24  48  49  61  60  )
    (50 69 1)
    simpleGrading (0.1 1.0 1.0)

    hex (   13  14  26  25  49  50  62  61  )
    (3 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   14  15  27  26  50  51  63  62  )
    (50 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   15  16  28  27  51  52  64  63  )
    (3 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   16  17  29  28  52  53  65  64  )
    (50 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   17  18  30  29  53  54  66  65  )
    (3 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   18  19  31  30  54  55  67  66  )
    (50 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   19  20  32  31  55  56  68  67  )
    (3 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   20  21  33  32  56  57  69  68  )
    (50 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   21  22  34  33  57  58  70  69  )
    (3 69 1)
    simpleGrading (1.0 1.0 1.0)

    hex (   22  23  35  34  58  59  71  70  )
    (50 69 1)
    simpleGrading (10.0 1.0 1.0)

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (   0   12  48  36   )
            (   12  24  60  48   )
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (   11  23  59  47   )
            (   23  35  71  59   )
        );
    }
    flap1
    {
        type wall;
        faces
        (
            (   1   13  49  37   )
            (   13  14  50  49   )
            (   2   14  50  38   )
        );
    }
    flap2
    {
        type wall;
        faces
        (
            (   3   15  51  39   )
            (   15  16  52  51   )
            (   4   16  52  40   )
        );
    }
    flap3
    {
        type wall;
        faces
        (
            (   5   17  53  41   )
            (   17  18  54  53   )
            (   6   18  54  42   )
        );
    }
    flap4
    {
        type wall;
        faces
        (
            (   7   19  55  43   )
            (   19  20  56  55   )
            (   8   20  56  44   )
        );
    }
    flap5
    {
        type wall;
        faces
        (
            (   9   21  57  45   )
            (   21  22  58  57   )
            (   10  22  58  46   )
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (   0   1   37  36   )
            (   2   3   39  38   )
            (   4   5   41  40   )
            (   6   7   43  42   )
            (   8   9   45  44   )
            (   10  11  47  46   )
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (   24  25  61  60   )
            (   25  26  62  61   )
            (   26  27  63  62   )
            (   27  28  64  63   )
            (   28  29  65  64   )
            (   29  30  66  65   )
            (   30  31  67  66   )
            (   31  32  68  67   )
            (   32  33  69  68   )
            (   33  34  70  69   )
            (   34  35  71  70   )
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (   0   1   13  12   )
            (   36  37  49  48   )
            (   2   3   15  14   )
            (   38  39  51  50   )
            (   4   5   17  16   )
            (   40  41  53  52   )
            (   6   7   19  18   )
            (   42  43  55  54   )
            (   8   9   21  20   )
            (   44  45  57  56   )
            (   10  11  23  22   )
            (   46  47  59  58   )
            (   12  13  25  24   )
            (   48  49  61  60   )
            (   13  14  26  25   )
            (   49  50  62  61   )
            (   14  15  27  26   )
            (   50  51  63  62   )
            (   15  16  28  27   )
            (   51  52  64  63   )
            (   16  17  29  28   )
            (   52  53  65  64   )
            (   17  18  30  29   )
            (   53  54  66  65   )
            (   18  19  31  30   )
            (   54  55  67  66   )
            (   19  20  32  31   )
            (   55  56  68  67   )
            (   20  21  33  32   )
            (   56  57  69  68   )
            (   21  22  34  33   )
            (   57  58  70  69   )
            (   22  23  35  34   )
            (   58  59  71  70   )
        );
    }
);
